import React from 'react'
import Breadcrumb from '../components/Breadcrumb'
import { Col, Container, Row } from 'react-bootstrap'
import Image from 'next/image'
import localFont from 'next/font/local'
const bangla = localFont({ src: '../fonts/TiroBangla-Regular.ttf' })


export default function page() {
  return (
      <>
        <Breadcrumb title="অধ্যক্ষের বাণী"/>
          <Container className={`section__gap_top ${bangla.className}`}>
            <Row className='gx-5'>
                <Col lg="4">
                    <div className='featur_people text-center'>
                        <h5 className='__label'>অধ্যক্ষ</h5>
                        <div className='_thumbnail'>
                            <Image
                                src="https://shariatpurpolytechnic.gov.bd/wp-content/uploads/2023/02/1678164847082.jpeg"
                                height='485'
                                width='387'
                                className='img-fluid'
                            />
                        </div>
                        <h5>শেখ মুস্তাফিজুর রহমান</h5>
                        <p>mussta230@gmail.com</p>
                    </div>
                </Col>
                <Col lg="8">
                    <div className='message_body'>
                        <h2>বিসমিল্লাহির রাহমানির রাহীম</h2>
                          <p>আলহামদুলিল্লাহ, ওয়াসসালাতু ওয়াসসালামু আলা রাসূলিল্লাহ। আম্মা বা'দ- সর্বশ্রেষ্ঠ জাতি মুসলিম উম্মাহ। এ জাতি শিক্ষা, সংস্কৃতি, অর্থনীতি, রাজনীতির স্বকীয়তা হারিয়েছে অনেক আগেই। ভেঙ্গে চুরমার হয়েছে ঈমানী-আখলাকী বুনিয়াদ। বৃটিশোত্তর ভারতীয় উপমহাদেশ তার জলন্ত স্বাক্ষী। বহুমুখি সঙ্কটে নিপতিত হয় ইসলামের লালনভূমি বাংলাদেশ। ক্রমেই হারাতে থাকে ইসলামী মূল্যবোধ ও ঐতিহ্য। হুমকির মুখে পড়ে মুসলিম উম্মাহর নতুন প্রজন্ম। ষাটের দশক। নুয়ে পড়া সে উম্মাহকে জাগিয়ে তুলতে ও স্থবির দেহে প্রাণ ফিরিয়ে আনতে নতুন করে কদম ফেলে তা‘মীরুল মিল্লাত ট্রাস্ট। ইসলাম ও সাধারণ শিক্ষার সমন্বয়ে একটি বাস্তবধর্মী শিক্ষা মিশনে তার পথচলা শুরু হয়। অব্যাহত পথচলার ধারাবাহিকতায় ১৯৯৭ সাল থেকে যুক্ত হয় তা‘মীরুল মিল্লাত কামিল মাদ্রাসা টঙ্গী। যুগোপযোগী দক্ষ আলিমে দ্বীন এবং সমাজের সর্বস্তরের জন্য দেশপ্রেমিক, সৎ ও যোগ্য নাগরিক তৈরি। এ মিশনে আত্মনিয়োগ করে বিস্তৃত সবুজ ক্যাম্পাস। পাঠদান শুরু হয় প্রাক-প্রাথমিক থেকে কামিল শ্রেণি পর্যন্ত। দাখিল ও আলিম শ্রেণিতে সাধারণ ও বিজ্ঞান বিভাগের পাশাপাশি কামিলে হাদীস এর সাথে যুক্ত হয় তাফসীর ও ফিক্হ বিভাগ। সফলতার স্বাক্ষর রেখে এগিয়ে চলছে তা‘মীরুল মিল্লাত। ক্রমান্বয়ে বড় হতে থাকে কুরআনের ছাত্রদের এ আঙিনা। আগ্রহী ও উদ্দিগ্ন অভিভাবকরা অভাব অনুভব করেন মেয়েদের দ্বীনী শিক্ষার। ২০১২ সাল। অব্যাহত চাহিদার প্রেক্ষিতে প্রতিষ্ঠিত হয় টঙ্গীতে বালিকা শাখা। ক্রমান্বয়ে শিশু থেকে কামিল পর্যন্ত পাঠ্যক্রমে যুক্ত হয় ছাত্রীরা।</p>
                    </div>
                </Col>
               
            </Row>
        </Container>
      </>
  )
}
